<a href="https://colab.research.google.com/github/nurimammasri/Wooky-Pandas/blob/master/02.%20DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Introduction**
DataFrame adalah suatu objek 2 dimensi tempat menyimpan data dengan lebih terstruktur. dataframe memiliki 2 index, yaitu index baris dan index columns. Dalam satu column dataframe harus memiliki tipe data yang sama. tapi antar columnnya dataframe bisa memiliki jenis data yang berbeda. 

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

## Features of DataFrame
*   Potentially columns are of different types
*   Size – Mutable
*   Labeled axes (rows and columns)
*   Can Perform Arithmetic operations on rows and columns

untuk lebih jelasnya perhatikan contoh berikut

In [2]:
import pandas as pd

df = pd.DataFrame({'tipe_int': [50, 21], 'tipe_string': ['a', 'b']})

In [3]:
#Tampilan ketika di print
print(df)
#Tampilan generate langsung
df

   tipe_int tipe_string
0        50           a
1        21           b

   tipe_int tipe_string
0        50           a
1        21           b

In [4]:
print(type(df))
type(df)

<class 'pandas.core.frame.DataFrame'>

pandas.core.frame.DataFrame

# **DataFrame Constructor**

A pandas DataFrame can be created using the following constructor −

> **pandas.DataFrame( data, index, columns, dtype, copy)**


*   **data**

data takes various forms like ndarray, series, map, lists, dict, constants and also another DataFrame.

*   **index**

For the row labels, the Index to be used for the resulting frame is Optional Default np.arange(n) if no index is passed.

*   **columns**

For column labels, the optional default syntax is - np.arange(n). This is only true if no index is passed.

*   **dtype**

Data type of each column.

*   **copy**

This command (or whatever it is) is used for copying of data, if the default is False.

In [5]:
pd.DataFrame?

In [6]:
import pandas as pd

df = pd.DataFrame({'Calon President': ['Imam', 'Abrar', 'Muthia', 'Itha'], 'Jumlah Voting': [100, 50, 60, 20]})
df

  Calon President  Jumlah Voting
0            Imam            100
1           Abrar             50
2          Muthia             60
3            Itha             20

## Index

In [7]:
df.index = ['a', 'b', 'c', 'd']
df

  Calon President  Jumlah Voting
a            Imam            100
b           Abrar             50
c          Muthia             60
d            Itha             20

In [8]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

## Columns

In [9]:
df.columns = ['Jumlah Voting', 'Calon President']
df

  Jumlah Voting  Calon President
a          Imam              100
b         Abrar               50
c        Muthia               60
d          Itha               20

In [10]:
df.columns

Index(['Jumlah Voting', 'Calon President'], dtype='object')

## Values

In [11]:
print(type(df.values))
df.values

<class 'numpy.ndarray'>

array([['Imam', 100],
       ['Abrar', 50],
       ['Muthia', 60],
       ['Itha', 20]], dtype=object)

In [12]:
df['Jumlah Voting'].values

array(['Imam', 'Abrar', 'Muthia', 'Itha'], dtype=object)

# **Create DataFrame**

A pandas DataFrame can be created using various inputs like −

*   Lists
*   Numpy Array
*   Dictionary
*   Series
*   Another DataFrame

In the subsequent sections of this chapter, we will see how to create a DataFrame using these inputs.

## Create Emty DataFrame

In [13]:
#import the pandas library and aliasing as pd
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

## Create a DataFrame from Lists
The DataFrame can be created using a *single list* or a *list of lists*.

list
> data = [1,2,3,4,5]

list of list

> data = [['Alex',10],['Bob',12],['Clarke',13]]

note :

*   Index dan Column secara default np.arange(n) -> 0, 1, 2, ..
*   bisa diubah dengan menggunakan index dan columns parameter
*   Nilai list akan digunakan sebagai nilai columns 1 
*   Hanya bisa menggunakan columns =[ ] parameter sebanyak dimensi data, jika tidak akan terjadi error

In [14]:
# make from list 
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [15]:
# make from list of list with columns
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [16]:
# make from list of list with columns and dtype parameter
# Observe, the dtype parameter changes the type of Age column to floating point.
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
print(df)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [17]:
# make from list of list with index, columns and dtype parameter
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,index=['one', 'two', 'tree'], columns=['Name','Age'],dtype=float)
print(df)

        Name   Age
one     Alex  10.0
two      Bob  12.0
tree  Clarke  13.0

## Create a DataFrame from Dict of ndarrays / Lists

All the ndarrays must be of same length. If index is passed, then the length of the index should equal to the length of the arrays.

If no index is passed, then by default, index will be range(n), where n is the array length.

Dictionary of ndarray / List
> {'Nama':['Imam', 'Itha', 'Kurnia', 'Aryanti'], 'Umur':[21, 34, 56, 78]}

catatan

*   ndarray/list jika memiliki lebih dari satu dari dictionary harus memiliki panjang yang sama.
*   Index = default 0,1,2,3..
*   Columns = berasal dari Key.
*   Value masing-masing column berasal dari ndarray / list nilai tiap key.

*   Jika melakukan akses parameter dengan columns = [] (parameter) jika tidak ada key yang sama maka akan menghasilkan nilai "NaN"

*NaN akan menyebabkan decimal type menjadi float*

In [18]:
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [19]:
#Memiliki panjang list yang berbeda
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29]}
# df = pd.DataFrame(data) #ERROR arrays must all be same length
print(data)

{'Name': ['Tom', 'Jack', 'Steve', 'Ricky'], 'Age': [28, 34, 29]}

In [20]:
#mengubah index
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
print(df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [21]:
#mengakses spesifik column dengan parameter
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'], columns=['Name', 'Address']) # tidak ada key Address maka NaN
print(df)

        Name Address
rank1    Tom     NaN
rank2   Jack     NaN
rank3  Steve     NaN
rank4  Ricky     NaN

In [22]:
#dictionary of list of list
import pandas as pd
data = {'Name':['Tom', ['Jack', 'Steve', 'Ricky']],'Age':[28,[34,29,42]]}
df = pd.DataFrame(data)
print(df)

                   Name           Age
0                   Tom            28
1  [Jack, Steve, Ricky]  [34, 29, 42]

## Create a DataFrame from Dict of Dict

In [23]:
# Membuat datafame sederhana
  
# importing pandas as pd 
import pandas as pd 
  
# membuat dataframe
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'}, 
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'}, 
                   'Age': {0: 27, 1: 23, 2: 21}}) 
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

## Create a DataFrame from List of Dicts

List of Dictionaries can be passed as input data to create a DataFrame. The dictionary keys are by default taken as column names.

List of Dictionary
> [{'a':1, 'b':2, 'c':3}, {'a':1, 'b':2, 'c':3, 'd':4}]

catatan

*   Index = default 0,1,2,3..
*   Columns = berasal dari key (Tapi ditentukan untuk tiap data dictionary dari list yang berbeda pada key mungkin berbeda disetiap data)
*   Value masing-masing column berasal dari value tiap key di tiap dictionary di list
*   Jika pada satu key memiliki key yang berbeda, maka untuk data dictionary pada list yang tidak memiliki nilai tersebut akan bernilai "NaN" untuk valuenya. disebut (Observe, NaN (Not a Number) is appended in ***missing areas***.)
*   Jika melakukan akses parameter dengan columns = [] (parameter) jika tidak ada key yang sama maka akan menghasilkan nilai "NaN"

*NaN akan menyebabkan decimal type menjadi float*

In [24]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
print(df)
# c index 0 akan bernilai NaN karena tidak ada pada data list dictionary pertama

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [25]:
#mengubah index
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
print(df)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [26]:
#contoh mengakses dengan column (dengan key not found)
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])

#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1']) # b1 tidak ada pada key maka akan bernilai NaN
print(df1)
print()
print(df2)

        a   b
first   1   2
second  5  10

        a  b1
first   1 NaN
second  5 NaN

## Create a DataFrame from Dict of Series
Dictionary of Series can be passed to form a DataFrame. The resultant index is the union of all the series indexes passed.


Dictionary of Series
> {'one':pd.Series([1,2,3], index=['a', 'b', 'c']), 'two':pd.Series([1,2,3,4], index=['a', 'b', 'c', 'd'])}

catatan

*   Index = default berasal dari nilai index pada Series (Tapi ditentukan untuk tiap data Series memiliki index mungkin berbeda disetiap data, maka jika salah satu items tdk ada index tersebut maka value bernilai NaN  ***missing areas***)
*   Columns = berasal dari key Tiap items Dictionary
*   Value masing-masing column berasal dari data Series dihubungkan dengan index parameter sebagai index columns
*   Jika melakukan akses parameter dengan columns = [] (parameter) jika tidak ada key yang sama maka akan menghasilkan nilai "NaN"

*NaN akan menyebabkan decimal type menjadi float*

In [27]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), # index d pada columns one akan bernilai NaN karena tidak memiliki nilai
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])} 

df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [28]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), # index d, e, f Nan
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), # index e, f Nan
   'tree' : pd.Series([1, 2, 3, 4, 5, 6], index=['a', 'b', 'c', 'd', 'e', 'f'])} 

df = pd.DataFrame(d)
print(df)

   one  two  tree
a  1.0  1.0     1
b  2.0  2.0     2
c  3.0  3.0     3
d  NaN  4.0     4
e  NaN  NaN     5
f  NaN  NaN     6

In [29]:
matematika = pd.Series({'otong':80, 'dinda':90, 'mamat':100})
fisika = pd.Series({'otong':90, 'dinda':70, 'mamat':100})
biologi = pd.Series({'otong':100, 'dinda':60, 'mamat':90})

df = pd.DataFrame({'matematika':matematika, 'fisika':fisika, 'biologi':biologi})
df

       matematika  fisika  biologi
otong          80      90      100
dinda          90      70       60
mamat         100     100       90

# Operation Between DataFrame

Dalam DataFrame boleh melakukan operasi aritmatika
Perlu diperhatikan nilai NaN jika dalam Aritmatika akan tetap menghasilkan NaN

In [30]:
import pandas as pd
data1 = {'Angka1': [1,2,3,4,5], 'Angka2':[5,4,3,2,1], 'Angka3':[1,3,5,7,9], 'Angka4':[9,7,5,3,1]}
data2 = {'Angka1': [2,4,6,8], 'Angka2':[8,6,4,2], 'Angka3':[1,3,5,7]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1

   Angka1  Angka2  Angka3  Angka4
0       1       5       1       9
1       2       4       3       7
2       3       3       5       5
3       4       2       7       3
4       5       1       9       1

In [31]:
df2

   Angka1  Angka2  Angka3
0       2       8       1
1       4       6       3
2       6       4       5
3       8       2       7

In [32]:
df1 + df2

   Angka1  Angka2  Angka3  Angka4
0     3.0    13.0     2.0     NaN
1     6.0    10.0     6.0     NaN
2     9.0     7.0    10.0     NaN
3    12.0     4.0    14.0     NaN
4     NaN     NaN     NaN     NaN

In [33]:
df1 - df2

   Angka1  Angka2  Angka3  Angka4
0    -1.0    -3.0     0.0     NaN
1    -2.0    -2.0     0.0     NaN
2    -3.0    -1.0     0.0     NaN
3    -4.0     0.0     0.0     NaN
4     NaN     NaN     NaN     NaN

In [34]:
df1 * df2

   Angka1  Angka2  Angka3  Angka4
0     2.0    40.0     1.0     NaN
1     8.0    24.0     9.0     NaN
2    18.0    12.0    25.0     NaN
3    32.0     4.0    49.0     NaN
4     NaN     NaN     NaN     NaN

In [35]:
df1 / df2

   Angka1    Angka2  Angka3  Angka4
0     0.5  0.625000     1.0     NaN
1     0.5  0.666667     1.0     NaN
2     0.5  0.750000     1.0     NaN
3     0.5  1.000000     1.0     NaN
4     NaN       NaN     NaN     NaN

In [36]:
df2['Angka3'] = df2['Angka2'] + df2['Angka1']
df2

   Angka1  Angka2  Angka3
0       2       8      10
1       4       6      10
2       6       4      10
3       8       2      10

# **Indexing/Akses Selection**

**Indexing DataFrame**
Akses DataFrame sering juga di kenal indexing atau Subset Selection. secara sederhana maknanya adalah kita memilih suatu data dari baris tertentu dan column tertentu. kita bisa saja memilih beberapa baris dan semua kolom dari data, semua baris dan beberapa column dari data, atau beberapa baris dan bebearpa column dari data.

Ada banyak cara-cara kita indexing suatu dataframe. diantranya adalah dengan menggunakan :

*   dataframe[] : cara seperti ini dikenal sebagai index operator.
*   dataframe.loc[]: operator yang menggunakan label untuk mengakses data, jika misalkan kamu melakukan dataframe.loc[‘jumlah’], berarti kamu hendak mengakses data yang mempunyai index jumlah
*   dataframe.iloc[: operator yang menggunakan posisi index untuk mengakses data. jikalau kamu melakukan dataframe.iloc[2] berarti kamu hendak mengakses dataframe dengan index posisi 2

....................

*name of colum*

df['column']

....................

df.loc[]

....................

*numeric*

df.iloc[ : , : ]

df.iloc[[ , , ],[ , , ]]

....................

## **Column Selection**

### df['column']

You can select a column (**df[col]**) and return column with label col as Series 

Or a few columns (**df[[col1, col2]]**) and returns columns as a new DataFrame.

In [37]:
import pandas as pd

df = pd.DataFrame({'Calon President': ['Imam', 'Abrar', 'Muthia', 'Itha'],
                   'Umur' : [12,34,5,67],
                   'Alamat' : ['Jln.1', 'Jln.2', 'Jln.3', 'Jln.4'],
                   'Jumlah Voting': [100, 50, 60, 20],
                   'Jenis Kelamin':['L', 'L', 'P', 'P'],
                   'Negara':['Indonesia', 'Australia', 'Amerika', 'Mesir']})
df

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia
2          Muthia     5  Jln.3             60             P    Amerika
3            Itha    67  Jln.4             20             P      Mesir

In [38]:
df[0:4]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia
2          Muthia     5  Jln.3             60             P    Amerika
3            Itha    67  Jln.4             20             P      Mesir

In [39]:
df['Umur'] #type() -> Series
df[['Umur']] # type() -> DataFrame

   Umur
0    12
1    34
2     5
3    67

In [40]:
df[['Calon President', 'Jumlah Voting', 'Jenis Kelamin']]

  Calon President  Jumlah Voting Jenis Kelamin
0            Imam            100             L
1           Abrar             50             L
2          Muthia             60             P
3            Itha             20             P

In [41]:
# menyimpan hasil pemilihan ke dalam variable
df2 = df[['Calon President', 'Jumlah Voting']]
df2

  Calon President  Jumlah Voting
0            Imam            100
1           Abrar             50
2          Muthia             60
3            Itha             20

In [42]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [43]:
import pandas as pd

df = pd.DataFrame({'Siswa': ['Imam', 'Abrar', 'Muthia', 'Itha'],
                   'Umur' : [12,34,5,67],
                   'Alamat' : ['Jln.1', 'Jln.2', 'Jln.3', 'Jln.4'],
                   'Jenis Kelamin':['L', 'L', 'P', 'P']})
df

    Siswa  Umur Alamat Jenis Kelamin
0    Imam    12  Jln.1             L
1   Abrar    34  Jln.2             L
2  Muthia     5  Jln.3             P
3    Itha    67  Jln.4             P

In [44]:
df[df['Umur'] >= 12]

   Siswa  Umur Alamat Jenis Kelamin
0   Imam    12  Jln.1             L
1  Abrar    34  Jln.2             L
3   Itha    67  Jln.4             P

In [45]:
df[(df['Umur'] >= 12) & (df['Jenis Kelamin'] == 'L')]

   Siswa  Umur Alamat Jenis Kelamin
0   Imam    12  Jln.1             L
1  Abrar    34  Jln.2             L

### df.column

In [46]:
import pandas as pd

df = pd.DataFrame({'Calon President': ['Imam', 'Abrar', 'Muthia', 'Itha'],
                   'Umur' : [12,34,5,67],
                   'Alamat' : ['Jln.1', 'Jln.2', 'Jln.3', 'Jln.4'],
                   'Jumlah Voting': [100, 50, 60, 20],
                   'Jenis Kelamin':['L', 'L', 'P', 'P'],
                   'Negara':['Indonesia', 'Australia', 'Amerika', 'Mesir']})
df

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia
2          Muthia     5  Jln.3             60             P    Amerika
3            Itha    67  Jln.4             20             P      Mesir

In [47]:
df.Umur

0    12
1    34
2     5
3    67
Name: Umur, dtype: int64

## **Row and Columns Selection**

### df.loc[ : , : ] and df.loc[ [ ] , [ ] ] (label)

***label*** indexing and slicing

*slicing*

> df.iloc[idx_row_start:idx_row_end, col_start:col_end]

indexing

> df.iloc[[row1,row2,row3,row n], [col1, col2, col3, col n]]

......................................................................................

[DataFrame.loc](https://pandas.pydata.org/pandas-docs/version/0.23.1/generated/pandas.DataFrame.loc.html)

Access a group of rows and columns by label(s) or a boolean array.

.loc[] is primarily label based, but may also be used with a boolean array.

Allowed inputs are:

* A single label, e.g. 5 or 'a', (note that 5 is interpreted as a label of the index, and never as an integer position along the index).

* A list or array of labels, e.g. ['a', 'b', 'c'].

* A slice object with labels, e.g. 'a':'f'.

`Warning Note that contrary to usual python slices, both the start and the stop are included`

* A boolean array of the same length as the axis being sliced, e.g. [True, False, True].

A callable function with one argument (the calling Series, DataFrame or Panel) and that returns valid output for indexing (one of the above)

In [48]:
import pandas as pd

df = pd.DataFrame({'Calon President': ['Imam', 'Abrar', 'Muthia', 'Itha'],
                   'Umur' : [12,34,5,67],
                   'Alamat' : ['Jln.1', 'Jln.2', 'Jln.3', 'Jln.4'],
                   'Jumlah Voting': [100, 50, 60, 20],
                   'Jenis Kelamin':['L', 'L', 'P', 'P'],
                   'Negara':['Indonesia', 'Australia', 'Amerika', 'Mesir']})
df

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia
2          Muthia     5  Jln.3             60             P    Amerika
3            Itha    67  Jln.4             20             P      Mesir

In [49]:
df.loc[0:2, 'Calon President':'Jumlah Voting']

  Calon President  Umur Alamat  Jumlah Voting
0            Imam    12  Jln.1            100
1           Abrar    34  Jln.2             50
2          Muthia     5  Jln.3             60

In [50]:
df.loc[[0,2], ['Calon President', 'Jumlah Voting']]

  Calon President  Jumlah Voting
0            Imam            100
2          Muthia             60

In [51]:
df.loc[df['Jenis Kelamin'] == 'L']

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia

In [52]:
df.loc[(df['Umur'] >= 12) & (df['Jenis Kelamin'] == 'L')]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia

In [53]:
lakilaki = df['Jenis Kelamin'] == 'L'
umur = df['Umur'] >= 12
df.loc[lakilaki & umur]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia

In [54]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

data_frame = pd.DataFrame(d)
print(data_frame.loc['b'])

one    2.0
two    2.0
Name: b, dtype: float64

### df.iloc[ : , : ] and df.iloc[ [ ] , [ ] ] (integer)

***numeric*** indexing and slicing

*slicing*

> df.iloc[idx_row_start:idx_row_end, col_start:col_end]

indexing

> df.iloc[[row1,row2,row3,row n], [col1, col2, col3, col n]]

In [55]:
df.iloc[0:2, :]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia

In [56]:
df.iloc[0:2,0:2]

  Calon President  Umur
0            Imam    12
1           Abrar    34

In [57]:
df.iloc[[3],:]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin Negara
3            Itha    67  Jln.4             20             P  Mesir

In [58]:
# df.iloc[0:2,['Umur', 'Alamat']] .iloc requires numeric indexers, got ['Umur' 'Alamat']
df.iloc[[0,2,3], [1,2]]

   Umur Alamat
0    12  Jln.1
2     5  Jln.3
3    67  Jln.4

In [59]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df.iloc[2])

one    3.0
two    3.0
Name: c, dtype: float64

## Task

cobalah suatu metode dari pandas untuk mengetahui beberapa data pertama dan beberapa data terakhir. kemudian sebutkan nilai dari:
- baris pertama dari column price
- baris terakhir dari column color

In [60]:
# from google.colab import drive
# drive.mount('/content/drive/')

In [61]:
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/diamonds-1.csv'
# Membaca data dan memasukannya kedalam suatu variabel
# url = 'https://blog.sanbercode.com/wp-content/uploads/2020/04/diamonds-1.csv'
# df_from_csv = pd.read_csv("diamonds-1.csv")

# import pandas as pd
# df_from_csv = pd.read_csv('https://drive.google.com/uc?id=13jtHSMJIa8gzYncyus2o2uTm-H_LFN0B')
# df_from_csv

In [64]:
# diamonds-1.csv
import pandas as pd
df_from_csv = pd.read_csv('https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Data/diamonds-1.csv')
df_from_csv

       Unnamed: 0  carat        cut color  ... price     x     y     z
0               1   0.23      Ideal     E  ...   326  3.95  3.98  2.43
1               2   0.21    Premium     E  ...   326  3.89  3.84  2.31
2               3   0.23       Good     E  ...   327  4.05  4.07  2.31
3               4   0.29    Premium     I  ...   334  4.20  4.23  2.63
4               5   0.31       Good     J  ...   335  4.34  4.35  2.75
...           ...    ...        ...   ...  ...   ...   ...   ...   ...
53935       53936   0.72      Ideal     D  ...  2757  5.75  5.76  3.50
53936       53937   0.72       Good     D  ...  2757  5.69  5.75  3.61
53937       53938   0.70  Very Good     D  ...  2757  5.66  5.68  3.56
53938       53939   0.86    Premium     H  ...  2757  6.15  6.12  3.74
53939       53940   0.75      Ideal     D  ...  2757  5.83  5.87  3.64

[53940 rows x 11 columns]

In [65]:
# code here
# Dengan index
df_from_csv['price'][[0]]
# Dengan method loc
df_from_csv.loc[0, ['price']]
# Dengan method iloc
df_from_csv['price'].iloc[[0]]
# Dengan method head
df_from_csv['price'].head(1)

0    326
Name: price, dtype: int64

In [66]:
# Dengan index
df_from_csv['color'][[len(df_from_csv)-1]]
# Dengan method tail()
df_from_csv['color'].tail(1)

53939    D
Name: color, dtype: object

## **Multiple Index in Pandas**

In [67]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]}, index=index)
df

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [68]:
import pandas as pd
stocks = pd.read_csv('http://bit.ly/smallstocks')
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [69]:
stocks.index #regular index

RangeIndex(start=0, stop=9, step=1)

In [70]:
stocks.groupby('Symbol').Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [71]:
stocks.groupby(['Symbol', 'Date']).Close.mean()

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [72]:
import pandas as pd
raw_data = {'city':['Tripoli', 'Tripoli', 'Rome', 'Rome', 'Sydney', 'Sydney'],
            'rank':['1st', '2nd', '1st', '2nd', '1st', '2nd'],
            'name':['Noureddin', 'Adam', 'Kevin', 'Raihana', 'Raghas', 'Mahdi'],
            'score1':[44, 48, 39, 41, 38, 44],
            'score2':[67, 63, 55, 70, 64, 77]}
df = pd.DataFrame(raw_data, columns = ['city', 'rank', 'name', 'score1', 'score2'])
df

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd    Raihana      41      70
4   Sydney  1st     Raghas      38      64
5   Sydney  2nd      Mahdi      44      77

In [73]:
df.set_index(['city', 'rank'], drop=False)

                 city rank       name  score1  score2
city    rank
Tripoli 1st   Tripoli  1st  Noureddin      44      67
        2nd   Tripoli  2nd       Adam      48      63
Rome    1st      Rome  1st      Kevin      39      55
        2nd      Rome  2nd    Raihana      41      70
Sydney  1st    Sydney  1st     Raghas      38      64
        2nd    Sydney  2nd      Mahdi      44      77

In [74]:
df.set_index(['city', 'rank'], drop=True)

                   name  score1  score2
city    rank
Tripoli 1st   Noureddin      44      67
        2nd        Adam      48      63
Rome    1st       Kevin      39      55
        2nd     Raihana      41      70
Sydney  1st      Raghas      38      64
        2nd       Mahdi      44      77

# Column Addition and Deletion

## Column Addition

Adding a new column by passing as Series
> df['three']=pd.Series([10,20,30],index=['a','b','c'])

Adding a new column using the existing columns in DataFrame
> df['four']=df['one']+df['three']

In [75]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

# Adding a new column to an existing DataFrame object with column label by passing new series

print ("Adding a new column by passing as Series:")
df['three']=pd.Series([10,20,30],index=['a','b','c'])
print(df)

print('')

print ("Adding a new column using the existing columns in DataFrame:")
df['four']=df['one']+df['three']

print(df)

Adding a new column by passing as Series:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

Adding a new column using the existing columns in DataFrame:
   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

## **Column Deletion**

using del function
*   del(df[columns]) / del df[columns]

using pop function
*   df.pop('columns')

In [76]:
# Using the previous DataFrame, we will delete a column
# using del function
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'three' : pd.Series([10,20,30], index=['a','b','c'])}

df = pd.DataFrame(d)
print ("Our dataframe is:")
print(df)

print('')

# using del function
print ("Deleting the first column using DEL function:")
del df['one']
print(df)

print('')

# using pop function
print ("Deleting another column using POP function:")
df.pop('two')
print(df)

Our dataframe is:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

Deleting the first column using DEL function:
   two  three
a    1   10.0
b    2   20.0
c    3   30.0
d    4    NaN

Deleting another column using POP function:
   three
a   10.0
b   20.0
c   30.0
d    NaN

# **Row Selection, Addition, and Deletion**

## Row Selection

### Selection by Label

In [77]:
# using loc[]
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

data_frame = pd.DataFrame(d)
print(data_frame.loc['b'])

one    2.0
two    2.0
Name: b, dtype: float64

### Selection by integer location

In [78]:
# using iloc[]
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df.iloc[2])

one    3.0
two    3.0
Name: c, dtype: float64

### Slice Rows
Multiple rows can be selected using ‘ : ’ operator.

In [79]:
# using [ : ] bukan [index]
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df[2:4])

   one  two
c  3.0    3
d  NaN    4

## Addition of Rows
Add new rows to a DataFrame using the append function. This function will append the rows at the end.

In [80]:
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [81]:
df_baru = df + df2
df_baru

    a   b
0   6   8
0  10  12
1  10  12
1  14  16

## Deletion of Rows

Use index label to delete or drop rows from a DataFrame. If label is duplicated, then multiple rows will be dropped.

If you observe, in the above example, the labels are duplicate. Let us drop a label and will see how many rows will get dropped.

In [82]:
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)

print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [83]:
# Drop rows with label 0 (duplicate label, all delete)
df = df.drop(0)
print(df)

   a  b
1  3  4
1  7  8